Repository: sushain97/apertium-monorepo-svn-82937
Catalog: incubator/en-ga-corpus/tmx/1922-1.tmx
Source language: en
Languages: ga

source: Any Bill passed or deemed to have been passed by both Houses may be suspended for a period of ninety days on the written demand of two-fifths of the members of Dáil Eireann or of a majority of the members of Seanad Eireann presented to the President of the Executive Council not later than seven days from the day on which such Bill shall have been so passed or deemed to have been so passed
ga: Aon Bhille a bheidh no a tuigfear a bheith rithte ag an dá Thigh, féadfar é chur ar fionraoi ar feadh deich lá is cheithre fichid, ach dhá chúigiú de theachtaí Dháil Éireann no mór-áireamh de bhaill Sheanaid Éireann á iarraidh i scríbhinn ar Uachtarán na hArd-Chomairlc fé cheann seacht lá, an tráth is déanaí dhe, ón lá a bheidh no a tuigfear a bheidh an Bille sin rithte

source: Such a Bill shall in accordance with regulations to be made by the Oireachtas be submitted by Referendum to the decision of the people if demanded before the expiration of the ninety days either by a resolution of Seanad Eireann assented to by three-fifths of the members of Seanad Eireann, or by a petition signed by not less than one-twentieth of the voters then on the register of voters, and the decision of the people by a majority of the votes recorded on such Referendum shall be conclusive
ga: Déanfar Bille den tsórt san do chur, do réir rialacha a dhéanfaidh an t-Oireachtas, fé bhreith na ndaoine le Referendum, má iarrtar san do dhéanamh fé cheann deich lá is cheithre fichid pe'ca le rún de Sheanad Éireann le n-a n-aontóidh trí chúigiú de bhaill Sheanaid Éireann, no le hachuiní a shighneoidh an fichiú cuid ar a luighead de sna vótáluithe a bheidh an uair sin ar chlár na vótáluithe, agus ní bheidh dul thar breith na ndaoine de réir mhóráirimh na vótanna a caithfear le linn a leithéid de Referendum

source: These provisions shall not apply to Money Bills or to such Bills as shall be declared by both Houses to be necessary for the immediate preservation of the public peace, health or safety
ga: Ní bheidh feidhm ag na forálacha so maidir le Billí Airgid ná le pé Billí a fhógróidh an dá Thigh a bheith riachtanach láithreach chun an tsíocháin no an tsláinte no an tsábháltacht phuiblí do chosaint

source: The Oireachtas may provide for the Initiation by the people of proposals for laws or constitutional amendments
ga: Féadfaidh an t-Oireachtas soláthar do dhéanamh chun tairisgintí ó sna daoine do thionnscnamh i dtaobh dlithe no i dtaobh leasuithe bun-reachta

source: Should the Oireachtas fail to make such provision within two years, it shall on the petition of not less than seventy five thousand voters on the register, of whom not more than fifteen thousand shall be voters in any one constituency, either make such provisions or submit the question to the people for decision in accordance with the ordinary regulations governing the Referendum
ga: Má theipeann ar an Oireachtas a leithéid de sholáthar do dhéanamh fé cheann dhá bhliain, déanfa sé, ar achuiní chúig míle déag is trí fichid míle vótáluíar an gclár, an chuid is lú dhe, ná beidh thar cúig míle déag aca 'na vótáluithe in aon dáilcheantar ar leithrigh, a leithéid de sholáthar no an cheist do chur fé bhreith na ndaoine do réir na ngnáth-rialacha a rialuíonn an Referendum

source: Any legislation passed by the Oireachtas providing for such Initiation by the people shall provide (1) that such proposals may be initiated on a petition of fifty thousand voters on the register, (2) that if the Oireachtas rejects a proposal so initiated it shall be submitted to the people for decision in accordance with the ordinary regulations governing the Referendum; and (3) that if the Oireachtas enacts a proposal so initiated, such enactment shall be subject to the provisions respecting ordinary legislation or amendments of the Constitution as the case may be
ga: Aon reachtúchán i dtaobh a leithéid de thionnscnamh ó sna daoine a rithfidh an t-Oireachtas, forálfar ann (1) go bhféadfar a leighéid de thairisgint do thionnscnamh ar achuiní leath-chéad míle vótáluí ar an gclár, (2) má dhiúltuíonn an t-Oireachtas do thairisgint a tionnscnófar amhlaidh, go gcuirfear fé bhreith na ndaoine é do réir na ngnáth-rialacha a rialuíonn an Referendum; agus (3) má achtuíonn an t-Oireachtas tairisgint a tionnscnófar amhlaidh, go mbeidh an t-achtú san do réir na bhforálacha a rialuíonn gnáth-reachtúchán no leasú ar an nBun-reacht pe'cu san é

source: Save in the case of actual invasion, the Irish Free State (Saorstát Eireann) shall not be committed to active participation in any war without the assent of the Oireachtas
ga: Ní cuirfear Saorstát Éireann fé oibleagáid páirt ghníomhach do thógaint in aon choga gan aontú an Oireachtais, ach amháin i gcás ionsuidhe do dhéanamh ar Éirinn

source: Amendments of this Constitution within the terms of the Scheduled Treaty may be made by the Oireachtas, but no such amendment, passed by both Houses of the Oireachtas, after the expiration of a period of eight years from the date of the coming into operation of this Constitution, shall become law, unless the same shall, after it has been passed or deemed to have been passed by the said two Houses of the Oireachtas, have been submitted to a Referendum of the people, and unless a majority of the voters on the register shall have recorded their votes on such Referendum, and either the votes of a majority of the voters on the register, or two-thirds of the votes recorded shall have been cast in favour of such amendment
ga: Féadfaidh an t-Oireachtas leasú do dhéanamh ar an mBunreacht so laistigh de théarmaí an Chonnartha Sgeidealta, ach tar éis ocht mblian ó dháta an Bhun-reachta so do theacht i bhfeidhm, ní dhéanfaidh dlí de n-a leithéid de leasu, ar n-a rith ag dhá Thigh an Oireachtais, mara ndéanfar, tar éis do dhá Thigh roimh-ráite an Oireachtais é do rith no tar éis a rith do thuisgint, an leasú san do chur fé referendum na ndaoine agus mara gcaithfidh móráireamh de sna vótáluithe ar an gclár a vótanna le linn a leithéid de referendum, agus vótanna mór-áirimh de sna vótáluithe ar an gclár, no dhá dtrian na vótanna sa chomhaireamh, do chaitheamh i bhfabhar an leasuithe

source: Any such amendment may be made within the said period of eight years by way of ordinary legislation and as such shall be subject to the provisions of Article 47 hereof
ga: Féadfar aon leasú dá shórt do dhéanamh laistigh den tréimhse ocht mblian roimh-ráite mar ghnáth-reachtúchán agus mar sin tiocfaidh fé choiníollacha Airtiogail 47 de seo

source: The Executive Authority of the Irish Free State (Saorstát Eireann) is hereby declared to be vested in the King, and shall be exercisable, in accordance with the law, practice and constitutional usage governing the exercise of the Executive Authority in the case of the Dominion of Canada, by the Representative of the Crown
ga: Fógartar leis seo Údarás Feidhmiúcháin Shaorstáit Éireann do bheith sealbhuithe sa Rí, agus go bhfeidhmeofar ag Ionadaí na Coróinneach é do réir an dlí an cleachta agus an úsáid bhunreachtúil a rialuíonn feidhmiú an údaráis fheidhmiúcháin i gcás Thiarnais Canada

source: There shall be a Council to aid and advise in the government of the Irish Free State (Saorstát Eireann) to be styled the Executive Council
ga: Beidh Comhairle ann dá ngoirfear an Ard-Chomhairle chun cabhruithe agus comhairlithe i rialú Shaorstáit Éireann

source: The Executive Council shall be responsible to Dáil Eireann, and shall consist of not more than seven nor less than five Ministers appointed by the Representative of the Crown on the nomination of the President of the Executive Council
ga: Beidh an Ard-Chomhairle freagarthach do Dháil Éireann, agus is é a líon seachtar n-Airí ar an gcuid is mó dhe no cúigear Airí ar an gcuid is lú dhe ar n-a gceapa ag Ionadaí na Coróinneach ar ainmniú Uachtaráin na hArd-Chomhairle

source: Those Ministers who form the Executive Council shall all be members of Dáil Eireann and shall include the President of the Council, the Vice-President of the Council and the Minister in charge of the Department of Finance
ga: Beidh Airí uile na hArd-Chomhairle 'na dteachtaí de Dháil Éireann agus beidh ortha Uachtarán na hArd-Chomhairle, Leas-Uachtarán na hArd-Chomhairle agus an t-Aire i gceannas Roinn an Airgid

source: The President of the Council shall be appointed on the nomination of Dáil Eireann
ga: Ceapfar Uachtarán na hArd-Chomhairle ar ainmniú Dháil Éireann

source: He shall nominate a Vice-President of the Council, who shall act for all purposes in the place of the President, if the President shall die, resign, or be permanently incapacitated, until a new President of the Council shall have been elected
ga: Ainmneoidh sé sin Leas-Uachtarán den Ard-Chomhairle, a ghníomhóidh chun gach críche in ionad an Uachtarián ar an Uachtarán d'fháil bháis, do thabhairt suas no do thuiteam fé mhí-chumas bhuan, go dtí go dtoghfar Uachtarán nua den Ard-Chomhairle

source: The Vice-President shall also act in the place of the President during his temporary absence
ga: Gníomhóidh an Leas-Uachtarán thar ceann an Uachtaráin, leis, le linn eisean do bheith as láthair go sealadach

source: The other Ministers who are to hold office as members of the Executive Council shall be appointed on the nomination of the President, with the assent of Dáil Eireann, and he and the Ministers nominated by him shall retire from office should he cease to retain the support of a majority in Dáil Eireann, but the President and such Ministers shall continue to carry on their duties until their successors shall have been appointed: Provided, however, that the Oireachtas shall not be dissolved on the advice of an Executive Council which has ceased to retain the support of a majority in Dáil Eireann
ga: Is ar ainmniú an Uachtaráin, le haontú na Dála, a ceapfar na hAirí eile atá chun bheith in oifig mar bhaill den Ard-Chomhairle, agus imeoidh an t-Uachtarán agus na hAirí a ainmneoidh sé as oifig má chailleann seisean tacuíocht mhór-áirimh i nDáil Éireann, ach leanfaidh an t-Uachtarán agus na hAirí sin ag déanamh a ndualgaisí go dtí go gceapfar a gconharbaí: Ar choiníoll, ámh, ná sguirfear an t-Oireachtas ar chomhairle aon Ard-Chomhairle go mbeidh tacuíocht mhór-áirimh i nDáil Éireann caillte aici

source: The Executive Council shall be collectively responsible for all matters concerning the Departments of State administered by Members of the Executive Council
ga: Beidh an Ard-Chomhairle freagarthach in aonacht i ngach cúrsa bhaineas leis na Ranna Stáit a bheidh á riara ag Baill den Ard-Chomhairle

source: The Executive Council shall prepare Estimates of the receipts and expenditure of the Irish Free State (Saorstát Eireann) for each financial year, and shall present them to Dáil Eireann before the close of the previous financial year
ga: Ullamhóidh an Ard-Chomhairle Meastacháin d'fháltas agus de chaiteachas Shaorstáit Éireann i gcóir gach bliana airgid, agus cuirfidh ós cóir Dháil Éireann iad roimh dheire na bliana airgid roimhe sin

source: The Executive Council shall meet and act as a collective authority
ga: Tiocfaidh an Ard-Chomhairle i gceann a chéile agus gníomhóid in aonacht mar aon údarás

source: Ministers who shall not be members of the Executive Council may be appointed by the Representative of the Crown, and shall comply with the provisions of Article 17 of this Constitution
ga: Féadfaidh Ionadaí na Coróinneach Airí ná beidh 'na mbaill den Ard-Chomhairle do cheapa agus géillfe siad san d'fhorálacha Airtiogail 17 den Bhun-reacht so

source: Every such Minister shall be nominated by Dáil Eireann on the recommendation of a Committee of Dáil Eireann chosen by a method to be determined by Dáil Eireann, so as to be impartially representative of Dáil Eireann
ga: Ainmneoidh Dáil Éireann gach Aire den tsórt san ar mhola Choiste de Dháil Éireann a toghfar i slí a bheartóidh Dáil Éireann i dtreo go n-ionadóid Dáil Éireann gan leithreachas

source: Should a recommendation not be acceptable to Dáil Eireann, the Committee may continue to recommend names until one is found acceptable
ga: Mara mbeidh Dáil Éireann sásta le aon mhola áirithe féadfaidh an Coiste leanúint ar ainmneacha do mhola go dtí go bhfaghfar ceann le n-a mbeifear sásta

source: The total number of Ministers, including the Ministers of the Executive Council, shall not exceed twelve
ga: Ní raghaidh lán-uimhir na n-Airí, agus Airí na hArd-Chomhairle d'áireamh ortha, thar dháréag

source: Every Minister who is not a member of the Executive Council shall be the responsible head of the Department or Departments under his charge, and shall be individually responsible to Dáil Eireann alone for the administration of the Department or Departments of which he is the head: Provided that should arrangements for Functional or Vocational Councils be made by the Oireachtas these Ministers or any of them may, should the Oireachtas so decide, be members of, and be recommended to Dáil Eireann by, such Councils
ga: Beidh gach Aire nách ball den Ard-Chomhairle 'na cheann freagarthach ar an Roinn no ar na Ranna a bheidh fé n-a chúram, agus beidh sé freagarthach uaidh féin do Dháil Éireann amháin i riara na Roinne no na Rann ar a mbeidh sé 'na cheann: Ar choiníoll, má dhineann an t-Oireachtas socrú i gcóir Comhairli Feidhme no Gairm-bheatha, go bhféadfaidh na hAirí seo no aon duine aca, má chinneann an t-Oireachtas amhlaidh, bheith 'na mbaill de sna Comhairlí sin agus bheith molta acu do Dháil Éireann

source: The term of office of any Minister, not a member of the Executive Council, shall be the term of Dáil Eireann existing at the time of his appointment, but he shall continue in office until his successor shall have been appointed, and no such Minister shall be removed from office during his term otherwise than by Dáil Eireann itself, and then for stated reasons, and after the proposal to remove him has been submitted to a Committee, chosen by a method to be determined by Dáil Eireann, so as to be impartially representative of Dáil Eireann, and the Committee has reported thereon
ga: Is é téarma oifige aon Aire, nách ball den Ard-Chomhairle, téarma na Dála a bheidh ann le linn a cheaptha, ach leanfa sé in oifig no go gceapfar a chomharba, agus is í Dáil Éireann féin amháin a chuirfidh aon Aire dá shórt as oifig le linn a théarma, agus san ar chúis a luadhfar, agus tar éis an tairisgint go gcuirfear as oifig é do chur fé bhráid Choiste, a toghfar i slí a bheartóidh Dáil Éireann, i dtreo go n-ionadófar Dáil Éireann gan leithreachas, agus tar éis don Choiste sin tuairisc do thabhairt ar an scéal

source: Every Minister shall have the right to attend and be heard in Seanad Eireann
ga: Beidh de cheart ag gach Aire bheith láithreach agus éisteacht d'fháil sa tSeanad

source: The appointment of a member of Dáil Eireann to be a Minister shall not entail upon him any obligation to resign his seat or to submit himself for re-election
ga: Má ceaptar teachta de Dháil Éireann 'na Aire ní bheidh d'oibleagáid air a shuidhchán do thabhairt suas ná dul fé ath-thogha

source: Ministers shall receive such remuneration as may from time to time be prescribed by law, but the remuneration of any Minister shall not be diminished during his term of office
ga: Gheobhaidh Airí pé luach saothair a socrófar ó am go ham le dlí, ach ní luigheadófar luach saothair aon Aire i rith a théarma oifige

source: The Representative of the Crown, who shall be styled the Governor-General of the Irish Free State (Saorstát Eireann) shall be appointed in like manner as the Governor-General of Canada and in accordance with the practice observed in the making of such appointments
ga: Ceapfar Ionadaí na Coróinneach, dá ngoirfear Seanascal Shaorstáit Éireann, ar an slí chéanna ceaptar Seanascal Canada agus de réir an chleachta atá in úsáid timpeal a leithéid de cheapa do dhéanamh

source: His salary shall be of the like amount as that now payable to the Governor-General of the Commonwealth of Australia and shall be charged on the public funds of the Irish Free State (Saorstát Eireann) and suitable provision shall be made out of those funds for the maintenance of his official residence and establishment
ga: Beidh a thuarastal ar có-mhéid leis an dtuarastal atá anois indíolta le Seanascal na hAstráile agus cuirfear de mhuirear é ar chiste phuiblí Shaorstáit Éireann agus déanfar soláthar oiriúnach as an gciste sin chun a áit chomhnuithe oifigiúil agus a theaghlachas do choinneáil suas

source: All revenues of the Irish Free State (Saorstát Eireann) from whatever source arising, shall, subject to such exception as may be provided by law, form one fund, and shall be appropriated for the purposes of the Irish Free State (Saorstát Eireann) in the manner and subject to the charges and liabilities imposed by law
ga: Déanfaidh ciste amháin d'fháltas uile Shaorstáit Éireann pé as é, gan dochar do pé eisceacht a socrófar le dlí, agus cuirfear i leithreas é chun úsáide Shaorstáit Éireann ar an gcuma agus fé sna muirir agus na fiachaisí ordófar le dlí

source: Dáil Eireann shall appoint a Comptroller and Auditor-General to act on behalf of the Irish Free State (Saorstát Eireann)
ga: Ceapfaidh Dáil Éireann Ard-Sgrúdóir chun gníomhuithe ar son Shaorstáit Éireann

source: He shall control all disbursements and shall audit all accounts of moneys administered by or under the authority of the Oireachtas and shall report to Dáil Eireann at stated periods to be determined by law
ga: Smachtóidh sé díoluíocht agus scrúdóidh cuntas gach airgid a riarfar ar ordú no fé údarás an Oireachtais, agus tabharfa sé tuairisg uaidh do Dháil Éireann ar uairibh áirithe a socrófar le dlí

source: The Comptroller and Auditor-General shall not be removed except for stated misbehaviour or incapacity on resolutions passed by Dáil Eireann and Seanad Eireann
ga: Ní cuirfear an t-Ard-Sgrúdóir as oifig ach mar gheall ar dhrochiompar no mí-chumas a luadhfar agus ar rúin a rithfidh Dáil Éireann agus Seanad Éireann

source: Subject to this provision, the terms and conditions of his tenure of office shall be fixed by law
ga: Gan dochar don bhforáil seo socrófar le dlí téarmaí agus coiníollacha sealbhuíochta a oifige

source: He shall not be a member of the Oireachtas, nor shall he hold any other office or position of emolument
ga: Ní bheidh sé 'na bhall den Oireachtas ná ní bheidh aon oifig ná ionad eile sochair aige

source: The judicial power of the Irish Free State (Saorstát Eireann) shall be exercised and justice administered in the public Courts established by the Oireachtas by judges appointed in manner hereinafter provided
ga: Is i sna Cúirteanna puiblí a bhunóidh an t-Oireachtas a cuirfear comhacht bhreithiúntais Shaorstáit Éireann i bhfeidhm agus a riarfar ceart le breithiúin a ceapfar i slí a foráltar 'na dhiaidh seo

source: These Courts shall comprise Courts of First Instance and a Court of Final Appeal to be called the Supreme Court
ga: Beidh ar na Cúirteanna so Cúirteanna Céad-Chéime agus Cúirt Aith-éisteachta Deire dá ngairmfear an Chúirt Uachtarach

source: The Courts of First Instance shall include a High Court invested with full original jurisdiction in and power to determine all matters and questions whether of law or fact, civil or criminal, and also Courts of local and limited jurisdiction, with a right of appeal as determined by law
ga: Ar na Cúirteanna Céad-Chéime beidh Ard-Chúirt, ag a mbeidh lán-údarás bunaidh agus comhacht chun socruithe gach cúrsa agus gach ceiste bhaineas le dlí no le fírinne, pe'ca síbhialta no coiriúil, agus fós Cúirteanna go mbeidh a n-údarás go háitiúil agus go teoranta maille le ceart aith-éisteachta mar a cinnfear le dlí

source: The judicial power of the High Court shall extend to the question of the validity of any law having regard to the provisions of the Constitution
ga: Raghaidh comhacht bhreithiúntais na hArd-Chúirte chó fada le ceist dlisteanachta aon dlí maidir le forálacha an Bhun-reachta

source: In all cases in which such matters shall come into question, the High Court alone shall exercise original jurisdiction
ga: Is í an Ard-Chúirt amháin a chuirfidh údarás bunaidh i bhfeidhm i ngach cás 'na dtiocfaidh cúrsaí den tsórt san i gceist

source: The Supreme Court of the Irish Free State (Saorstát Eireann) shall, with such exceptions (not including cases which involve questions as to the validity of any law) and subject to such regulations as may be prescribed by law, have appellate jurisdiction from all decisions of the High Court
ga: Gan dochar do pé rialacha agus maille le pé eisceachtaí a cinnfear le dlí (lasmuich d'aon chás do thabharfadh ceist dlisteanachta aon dlí anuas) beidh údarás aith-éisteachta ag Cúirt Uachtarach Shaorstáit Éireann ar gach breith den Ard-Chúirt

source: The decision of the Supreme Court shall in all cases be final and conclusive, and shall not be reviewed or capable of being reviewed by any other Court, Tribunal or Authority whatsoever: Provided that nothing in this Constitution shall impair the right of any person to petition His Majesty for special leave to appeal from the Supreme Court to His Majesty in Council or the right of His Majesty to grant such leave
ga: Ní bheidh dul thar breith na Cúirte Uachtaraighe in aon chás, agus ní déanfar aith-bhreithniú ná ní féadfar aith-bhreithniú do dhéanamh ar an mbreith sin ag aon Chúirt, Binse ná Údarás eile ar bith: Ar choiníoll ná déanfaidh éinní sa Bhun-reacht so baint ó cheart aon duine chun cead speisialta d'achuiní ar a Shoillse chun a chúis do thabhairt fé aith-éisteacht ón gCúirt Uachtarach go dtí a Shoillse i gComhairle ná baint ó cheart a Shoillse chun a leithéid de chead do dheonú

source: The number of judges, the constitution and organisation of; and distribution of business and jurisdiction among, the said Courts and judges, and all matters of procedure shall be as prescribed by the laws for the time being in force and the regulations made thereunder
ga: De réir na ndlithe bheidh i bhfeidhm de thurus na huaire agus do réir na rialacha a déanfar fútha iseadh bheidh uimhir na mbreithiún, bunú agus có-ghléasa agus roint ghnótha agus údaráis imeasg na gCúirteanna agus na mbreithiún roimh-ráite, agus gach ní bhaineas le nós imeachta

source: The judges of the Supreme Court and of the High Court and of all other Courts established in pursuance of this Constitution shall be appointed by the Representative of the Crown on the advice of the Executive Council
ga: Is é Ionadaí na Coróinneach a cheapfaidh ar chomhairle na hArd-Chomhairle breithiúin na Cúirte Uachtaraighe agus na hArd-Chúirte agus na gCúirteanna eile go léir a bunófar do réir an Bhun-reachta so

source: The judges of the Supreme Court and of the High Court shall not be removed except for stated misbehaviour or incapacity, and then only by resolutions passed by both Dáil Eireann and Seanad Eireann
ga: Ní cuirfear breithiúin na Cúirte Uachtaraighe ná na hArd-Chúirte as oifig ach mar gheall ar mhí-iompar no mhí-chumas a luadhfar, agus ansan féin le rúin a rithfear ag Dáil Éireann agus Seanad Éireann araon

source: The age of retirement, the remuneration and the pension of such judges on retirement and the declarations to be taken by them on appointment shall be prescribed by law
ga: Socrófar le dlí aois oifige d'fhágaint, luach saothair agus pinsean a leithéidí de bhreithiúin ar oifig d'fhágaint dóibh agus an dearbhtha a thabharfaid uatha le linn a gceaptha

source: Such remuneration may not be diminished during their continuance in office
ga: Ní féadfar an luach saothair sin do luigheadú an fhaid a leanfaid in oifig

source: The terms of appointment of the judges of such other courts as may be created shall be prescribed by law
ga: Socrófar le dlí téarmaí ceaptha breithiún aon chúirteanna eile a bunófar
